Revit 2024 API
TransactionGroup Constructor (Document)
 Constructs a transaction group object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public TransactionGroup(
	Document document
)
Visual Basic
Public Sub New ( _
	document As Document _
)
Visual C++
public:
TransactionGroup(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document for which this transaction group is being used.
Remarks
 The group does not start until its Start method is called.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TransactionGroup Class
TransactionGroup Overload
Autodesk.Revit.DB Namespace